Revit 2026 API

# IModuleMaker Interface

---

The interface used to create module project.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IModuleMaker
```
```vb
Public Interface IModuleMaker
```
```cpp
public interface class IModuleMaker
```
```fsharp
type IModuleMaker = interface end
```

The IModuleMaker type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | The method that Revit will invoke to create module project. When implementing this interface, programmer is responsible for making it exception-free |

Implement this interface to create module project.

#### Reference

Autodesk.Revit.DB.Macros Namespace